GROUPS = [
    "Бас-251", "Бд-231", "Бд-241", "Бд-251", "Вет-221", "Вет-222", "Вет-223",
    "Вет-231", "Вет-232", "Вет-241", "Вет-242", "Вет-251", "Вет-252", "До-251",
    "Зем-221", "Зем-241", "Зчс-221", "Зчс-222", "Зчс-223", "Зчс-224", "Зчс-231",
    "Зчс-232", "Зчс-233", "Зчс-234", "Зчс-241", "Зчс-242", "Зчс-243", "Зчс-251",
    "Зчс-252", "Зчс-253", "Исп-221", "Исп-222", "Исп-231", "Исп-232", "Исп-241",
    "Исп-242", "Исп-251", "Исп-252", "Ма-241", "Ма-242", "Ма-251", "Мх-221",
    "Мхт-231", "Мхт-241", "Мхт-251", "Одл-231", "Одл-241", "Одл-242", "Одл-251",
    "Одл-252", "Оп-231", "Оп-241", "Оп-251", "Оэр-251", "Пб-221", "Пб-231",
    "Пб-241", "Пк-221", "Пк-231", "Пк-241", "Пкд-221", "Пкд-222", "Пкд-231",
    "Пкд-232", "Пкд-241", "Пкд-251", "Пп-251", "Прав-231", "Р-221", "Р-231",
    "Р-241", "Р-251", "Рзх-251", "Св-241", "Св-242", "Св-251", "Св-252",
    "Тг-231", "Тг-241", "Тг-251", "Тд-241", "Тд-251", "Тик-231", "Тик-241",
    "Тоа-251", "Тоа-252", "Тов-231", "Тод-221", "Тод-222", "Тод-231", "Тод-233",
    "Тод-241", "Тод-242", "Тпи-221", "Юр-241", "Юр-251"
]

async def init_groups(pool):
    """Инициализирует таблицу групп предустановленным списком"""
    async with pool.acquire() as conn:
        # Начинаем транзакцию
        async with conn.transaction():
            # Очищаем таблицу
            await conn.execute("DELETE FROM groups")
            # Добавляем группы
            await conn.executemany(
                "INSERT INTO groups (name) VALUES ($1)",
                [(group,) for group in GROUPS]
            )
        print(f"Добавлено {len(GROUPS)} групп в базу данных")